<a href="https://colab.research.google.com/github/Nehaasati/DSA_1/blob/master/DS_Laannet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(columns=["one", "two","third"])

df.one = ["2020-01-24","2020-01-27","24-07-2020","2020-07-12","12-02-2020","AAAA","31-02-2012","XY-ZA-AA","04-15-1988","MAY-21-1919"]
df1 = pd.to_datetime(df['one'], errors='coerce')##Check input value are in date formate or not. if it's not in date formate as sign it's AS Nan
print(df1)#print and check 
df1.one = df1.dropna()##drop those data which is not in date format
print(df1.one)
df.two = ["2020-01-28", "2020-01-29","12-09-2020","2021-01-11","13-07-2021","AA-AA-YYY","DEC-31-1820","21-11-1890","JUN-10-1888","aaaa"]
df2=pd.to_datetime(df['two'], errors='coerce')###Check input value are in date formate or not. if it's not in date formate as sign it's AS Nan
print(df2)
df2.two = df2.dropna()#drop those data which is not in date format
print(df2.two)
df.third =["2020-01-10","2021-02-24","10-09-2020","2021-02-11","12-02-2011","aa-YY-MM","01-JUN-1999","MAY-1817-23","JULY-22-1990","11-aa-11"]
df3=pd.to_datetime(df['third'], errors='coerce')#Check input value are in date formate or not. if it's not in date formate as sign it's AS Nan
print(df3)
df3.third = df1.dropna()#drop those data which is not in date format
print(df3.third)


difference = (df2.two - df1.one)##(difference between first two data set)
difference1=(df3.third-df2.two)#difference between third and  two data set)
difference2=(df3.third-df1.one)#difference between third and first data set)
print(difference)
print(difference1)
print(difference2)

0   2020-01-24
1   2020-01-27
2   2020-07-24
3   2020-07-12
4   2020-12-02
5          NaT
6          NaT
7          NaT
8   1988-04-15
9   1919-05-21
Name: one, dtype: datetime64[ns]
0   2020-01-24
1   2020-01-27
2   2020-07-24
3   2020-07-12
4   2020-12-02
8   1988-04-15
9   1919-05-21
Name: one, dtype: datetime64[ns]
0   2020-01-28
1   2020-01-29
2   2020-12-09
3   2021-01-11
4   2021-07-13
5          NaT
6   1820-12-31
7   1890-11-21
8   1888-06-10
9          NaT
Name: two, dtype: datetime64[ns]
0   2020-01-28
1   2020-01-29
2   2020-12-09
3   2021-01-11
4   2021-07-13
6   1820-12-31
7   1890-11-21
8   1888-06-10
Name: two, dtype: datetime64[ns]
0   2020-01-10
1   2021-02-24
2   2020-10-09
3   2021-02-11
4   2011-12-02
5          NaT
6   1999-06-01
7   1817-05-23
8   1990-07-22
9          NaT
Name: third, dtype: datetime64[ns]
0   2020-01-24
1   2020-01-27
2   2020-07-24
3   2020-07-12
4   2020-12-02
8   1988-04-15
9   1919-05-21
Name: one, dtype: datetime64[ns]
0        4 days
1        2 days
2      138 days
3      183 days
4      223 days
6           NaT
7           NaT
8   -36468 days
9           NaT
dtype: timedelta64[ns]
0      -4 days
1      -2 days
2    -138 days
3    -183 days
4    -223 days
6          NaT
7          NaT
8   36468 days
9          NaT
dtype: timedelta64[ns]
0   0 days
1   0 days
2   0 days
3   0 days
4   0 days
8   0 days
9   0 days
Name: one, dtype: timedelta64[ns]

In [2]:
from numpy.random import randn
from numpy.random import seed
from scipy.stats import pearsonr
# seed random number generator
seed(1)
import pandas as pd
import numpy as np
df = pd.DataFrame(columns=["data1", "data2","data3","data4","data5","data6","data7","data8","data9","data10"])
# prepare data
df.data1 = 20 * randn(1000) + 100
df.data2 = df.data1 + (10 * randn(1000) + 50)
df.data3 = df.data2+(30* randn(1000)+30)
df.data4 = df.data1+(20*randn(1000)+90)              
df.data5 =  df.data3+(10*randn(1000)+80)
df.data6 = df.data1+(20*randn(1000)+30)
df.data7 = df.data4+(30*randn(1000)+70)
df.data8 = df.data5+(10*randn(1000)+40)
df.data9 = df.data6+(20*randn(1000)+30) 
df.data10 = df.data7+(30*randn(1000)+60)

In [3]:
df.head()

        data1       data2       data3  ...       data8       data9      data10
0  132.486907  180.954546  225.640044  ...  353.437120  129.606678  284.433444
1   87.764872  113.439787  150.603662  ...  272.201071  145.662926  358.005120
2   89.436565  144.516408  161.073054  ...  298.951431  163.429653  306.418599
3   78.540628  125.300304  136.976454  ...  268.399292   97.357354  248.888195
4  117.308153  152.197387  121.299034  ...  260.093724  201.931147  358.635630

[5 rows x 10 columns]

In [4]:
# calculate Pearson's correlation
corr, _ = pearsonr(df.data1,df.data2)
print('Pearsons correlation: %.3f' % corr)

Pearsons correlation: 0.888

In [44]:
# Create correlation matrix
corr_matrix = df.corr(method = 'pearson')
print((corr_matrix).values())
#print(corr_matrix.sort_values('data1', ascending=False))
temp = df.drop(max(corr_matrix), axis=1)
#temp.head()
# Select upper triangle of correlation matrix
#upper = corr_matrix.where(np.triu(np.ones(corr_matrix.shape), k=1).astype(np.bool))

# Find index of feature columns with correlation greater than 0.85
#to_drop = [column for column in upper.columns if any(upper[column] > 0.85)]
# Drop features 
#df.drop(df[to_drop], axis=1)

TypeError: ignored

In [28]:
def get_redundant_pairs(df):
    '''Get diagonal and lower triangular pairs of correlation matrix'''
    pairs_to_drop = set()
    cols = df.columns
    for i in range(0, df.shape[1]):
        for j in range(0, i+1):
            pairs_to_drop.add((cols[i], cols[j]))
    return pairs_to_drop

def get_top_abs_correlations(df, n):
    temp_col_list = []
    au_corr = df.corr().abs().unstack()
    labels_to_drop = get_redundant_pairs(df)
    temp_col_list = [item for t in labels_to_drop for item in t]
    print(labels_to_drop)
    print(len(temp_col_list))
    au_corr = au_corr.drop(labels=labels_to_drop).sort_values(ascending=False)
    #print(au_corr[1])
    return au_corr[0:n]

print("Top Absolute Correlations")
print(get_top_abs_correlations(df, 5))

Top Absolute Correlations
{('data7', 'data3'), ('data9', 'data4'), ('data10', 'data4'), ('data7', 'data4'), ('data4', 'data4'), ('data5', 'data1'), ('data9', 'data3'), ('data8', 'data7'), ('data8', 'data6'), ('data9', 'data9'), ('data10', 'data3'), ('data10', 'data9'), ('data10', 'data10'), ('data10', 'data1'), ('data10', 'data6'), ('data8', 'data8'), ('data4', 'data1'), ('data2', 'data2'), ('data3', 'data2'), ('data8', 'data4'), ('data5', 'data2'), ('data9', 'data5'), ('data10', 'data8'), ('data6', 'data2'), ('data6', 'data3'), ('data8', 'data5'), ('data9', 'data2'), ('data6', 'data5'), ('data8', 'data3'), ('data6', 'data4'), ('data7', 'data2'), ('data3', 'data3'), ('data7', 'data5'), ('data8', 'data1'), ('data4', 'data2'), ('data2', 'data1'), ('data3', 'data1'), ('data10', 'data7'), ('data9', 'data6'), ('data9', 'data7'), ('data9', 'data1'), ('data6', 'data1'), ('data7', 'data7'), ('data6', 'data6'), ('data5', 'data4'), ('data1', 'data1'), ('data8', 'data2'), ('data7', 'data6'), ('data9', 'data8'), ('data7', 'data1'), ('data4', 'data3'), ('data10', 'data5'), ('data5', 'data5'), ('data10', 'data2'), ('data5', 'data3')}
110
data5  data8     0.965438
data3  data5     0.961241
       data8     0.926834
data1  data2     0.887612
data7  data10    0.815160
dtype: float64

In [50]:
import pandas as pd
import numpy as np

def find_correlation(data, threshold=0.85, remove_negative=True):
    """
    Given a numeric pd.DataFrame, this will find highly correlated features,
    and return a list of features to remove.
    Parameters
    -----------
    data : pandas DataFrame
        DataFrame
    threshold : float
        correlation threshold, will remove one of pairs of features with a
        correlation greater than this value.
    remove_negative: Boolean
        If true then features which are highly negatively correlated will
        also be returned for removal.
    Returns
    --------
    select_flat : list
        listof column names to be removed
    """
    corr_mat = data.corr()
    if remove_negative:
        corr_mat = np.abs(corr_mat)
    corr_mat.loc[:, :] = np.tril(corr_mat, k=-1)
    already_in = set()
    result = []
    for col in corr_mat:
        perfect_corr = corr_mat[col][corr_mat[col] > threshold].index.tolist()
        if perfect_corr and col not in already_in:
            already_in.update(set(perfect_corr))
            perfect_corr.append(col)
            result.append(perfect_corr)
    select_nested = [f[1:] for f in result]
    select_flat = [i for j in select_nested for i in j]
    return select_flat

In [52]:
print(find_correlation(df))
temp = df.drop(find_correlation(df), axis=1)
temp.head()

['data1', 'data8', 'data3']

        data2       data4       data5  ...       data7       data9      data10
0  180.954546  220.944768  304.236334  ...  205.412682  129.606678  284.433444
1  113.439787  181.921377  232.020079  ...  276.615080  145.662926  358.005120
2  144.516408  199.160484  244.192740  ...  260.918175  163.429653  306.418599
3  125.300304  197.195756  224.667306  ...  246.552714   97.357354  248.888195
4  152.197387  217.873323  207.141892  ...  321.475748  201.931147  358.635630

[5 rows x 7 columns]